MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX150F256L.PIC
      <edc:SFRDef edc:_addr="0x1F80FBE0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="57" edc:access="----------------------------nnnn" edc:cname="RPD8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD8R" edc:desc="" edc:mask="0xf" edc:name="RPD8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBE4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="58" edc:access="----------------------------nnnn" edc:cname="RPD9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD9R" edc:desc="" edc:mask="0xf" edc:name="RPD9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBE8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="59" edc:access="----------------------------nnnn" edc:cname="RPD10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD10R" edc:desc="" edc:mask="0xf" edc:name="RPD10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBEC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="60" edc:access="----------------------------nnnn" edc:cname="RPD11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD11R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD11R" edc:desc="" edc:mask="0xf" edc:name="RPD11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBF0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="61" edc:access="----------------------------nnnn" edc:cname="RPD12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD12R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD12R" edc:desc="" edc:mask="0xf" edc:name="RPD12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBF4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="62" edc:access="----------------------------nnnn" edc:cname="RPD13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD13R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD13R" edc:desc="" edc:mask="0xf" edc:name="RPD13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBF8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="63" edc:access="----------------------------nnnn" edc:cname="RPD14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD14R" edc:desc="" edc:mask="0xf" edc:name="RPD14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBFC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="64" edc:access="----------------------------nnnn" edc:cname="RPD15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD15R" edc:desc="" edc:mask="0xf" edc:name="RPD15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC00" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="65" edc:access="----------------------------nnnn" edc:cname="RPE0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE0R" edc:desc="" edc:mask="0xf" edc:name="RPE0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC04" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="66" edc:access="----------------------------nnnn" edc:cname="RPE1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPE1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE1R" edc:desc="" edc:mask="0xf" edc:name="RPE1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
